import React, {Component} from "react";

import "./sliderStyle.css";
import Slider from "react-slick";
import Img05 from "./img/img5.jpg";
import Img06 from "./img/img6.jpg";
import Img07 from "./img/img7.jpg";
import Img08 from "./img/img8.jpg";
import Img09 from "./img/gatesImg/parkan2-1024x635.png";
import Img10 from "./img/2628759.webp";
import Img11 from "./img/img9.webp";
import Img12 from "./img/img10.webp";
import Img13 from "./img/img11.jpg";
import Img15 from "./img/img13.jpg";
import Img16 from "./img/img14.jpg";
import Img17 from "./img/img15.jpg";
import Img19 from "./img/img17.jpg";
import Img20 from "./img/img18.jpg";

function SampleNextArrow(props) {
    const { className, style, onClick } = props;
    return (
        <div
            className={className}
            style={{ ...style, display: "block", background: "#333", borderRadius:"20px" }}
            onClick={onClick}
        />
    );
}

function SamplePrevArrow(props) {
    const { className, style, onClick } = props;
    return (
        <div
            className={className}
            style={{ ...style, display: "block", background: "#333" , borderRadius:"20px" }}
            onClick={onClick}
        />
    );
}


export default class GatesWicket extends Component {
    constructor(props) {
        super(props);
        this.state = {
            nav1: null,
            nav2: null
        };
    }
    componentDidMount() {
        this.setState({
            nav1: this.slider1,
            nav2: this.slider2
        });
    }
    render() {
        let gatesImgStyle = document.getElementsByClassName("gatesImgStyle")[0];

        function addHoverStyle() {
            gatesImgStyle.classList.add("gatesNoHoverStyle");
        }
        return (
            <div>
                <h1 className="gatesH1">МЕТАЛЕВІ ВОРОТА ТА ХВІРТКИ</h1>
                <Slider
                    asNavFor={this.state.nav1}
                    ref={slider => (this.slider2 = slider)}
                    slidesToShow={2}
                    speed={110}
                    swipeToSlide={true}
                    focusOnSelect={true}>
                    <div>
                        <div className="fenceHeader text-center fenceHeader fadeInUp">
                            <p className="tree_link GateshoverHR hoverHR marginSlider">ВІДКАТНІ ВОРОТА</p>
                        </div>
                    </div>
                    <div>
                        <div className="fenceHeader_hr text-center fenceHeader fadeInUp">
                            <p className="aluminum_link GateshoverHR hoverHR marginSlider">РОЗПАШНІ ВОРОТА</p>
                        </div>
                    </div>
                    <div>
                        <div className="fenceHeader_hr text-center fenceHeader fadeInUp">
                            <p className="plastic_link GateshoverHR hoverHR marginSlider">МЕТАЛЕВІ ХВІРТКИ</p>
                        </div>
                    </div>
                    <div>
                        <div className="fenceHeader_hr text-center fenceHeader fadeInUp">
                            <p className="french_link GateshoverHR hoverHR marginSlider">АВТОМАТИЧНІ ВОРОТА</p>
                        </div>
                    </div>
                </Slider>
                <hr/>
                <Slider
                    asNavFor={this.state.nav2}
                    nextArrow={<SampleNextArrow />}
                    prevArrow={<SamplePrevArrow />}
                    ref={slider => (this.slider1 = slider)}>
                    {/*ВІДКАТНІ ВОРОТА*/}
                    <div>
                        <div className="GatesdescriptionAndInfo">
                            <div className="text_fenseDescription gates_fenseDescription fenceDescr">
                                <h4>Технічні характеристики</h4>
                                <p>Все більшу популярність завойовують відкатні ворота консольного типу. Основною
                                    перевагою,
                                    перед воротами класичного розпашного типу, є відсутність необхідності вільного
                                    місця
                                    для
                                    відкривання стулки воріт. Що особливо актуально в зимовий час, при рясних
                                    снігових
                                    опадах.</p>
                                <p>Принцип роботи воріт не залежить від їх розмірів, матеріалів і дизайну. Відкатні
                                    ворота
                                    влаштовані так, що їх полотно плавно ковзає по консолі в сторону вздовж паркану.
                                    Цьому
                                    сприяє роликовий механізм, укріплений на фундаменті. Ви можете відкривати їх
                                    вручну,
                                    а
                                    якщо їх автоматизувати, то використовуючи пульт. Вирішувати Вам. Від інших типів
                                    воріт
                                    вони виділяються більш простою конструкцією, але від цього не менш надійною та
                                    безпечною. Система роликових кареток, завдяки якій відкатні ворота рухаються
                                    вздовж
                                    огорожі, забезпечує економію простору, зменшує зусилля, що докладаються, не
                                    заважає
                                    оточуючим (перехожим, проїжджаючим транспортним засобам), не загороджує кут
                                    огляду
                                    водія
                                    при виїзді, за її використання.</p>
                                <p>Конструкція відкатних воріт досить проста, що дозволяє їх використовувати не
                                    тільки
                                    на
                                    промислових об’єктах, але і в приватних котеджах. А вибравши відповідний дизайн,
                                    Ви
                                    можете додати індивідуальності та презентабельності своїй ділянці. Завдяки
                                    встановленню
                                    якісної автоматики від надійних фірм-виробників на ворота, вони відкриваються
                                    автоматично, не вимагаючи фізичних зусиль і також відпадає необхідність залишати
                                    автомобіль.</p>
                            </div>
                            <div className="ol_fenseDescription gates_fenseDescription fenceDescr">
                                <ul>
                                    <h3>Відкатні ворота — відмінний варіант для безпеки обгороджених ділянок!</h3>
                                    <p>Коли Ви прагнете забезпечити максимальну безпеку на доступ обгородженої
                                        приватної території й замовляєте відкатні ворота, ціна не грає великої ролі. З
                                        досвіду установки таких воріт, ми можемо стверджувати, що для клієнта більш
                                        важливим є питання якості, а вже ціна повинна відповідати заявленій якості. На
                                        сайті компанії «Бона Трейд» можна побачити детальну інформацію про всі
                                        пропоновані для монтажу моделі воріт. Представлені також відкатні ворота, фото
                                        яких дивіться в деталях.</p>
                                    <h3>Чим відкатні ворота відрізняються від інших конструкцій воріт?</h3>
                                    <p>Наші замовники вважають за краще купити відкатні ворота, ціна яких
                                        якісно-перспективна в експлуатації. Слід сказати, що останнім часом на ринку
                                        України з’явилося дуже багато якісних аналогів комплектуючих деталей, які
                                        нітрохи не гірші від закордонних, а вартість воріт істотно знижується. Усі
                                        варіанти моделей воріт із зазначенням виробника докладно описані в каталозі
                                        нашого сайту. Там же представлені відкатні ворота з хвірткою, які користуються
                                        великою популярністю для установки в приватних домоволодіннях.</p>
                                    <p>Якщо говорити про основні відмінності воріт від розпашних моделей або роллетних,
                                        то різниця очевидна. Наведемо кілька прикладів таких відмінностей:</p>
                                    <li>По-сучасному креативний зовнішній вигляд. Ваша ділянка буде вигідно відрізнятися
                                        від сусідських ділянок своєю солідністю і презентабельністю;
                                    </li>
                                    <li>Конструкція відкатних воріт відрізняється ергономічністю, не «з’їдається»
                                        корисна площа території, на якій ці ворота встановлюють;
                                    </li>
                                    <li>Ворота відкатні Харків, Одеса, Дніпро і в інших містах України замовляють досить
                                        часто, тому що вони не дуже масивні. При порівняно невеликій вазі, вони
                                        залишаються надійними й міцними, а для їх відкриття не потрібно докладати багато
                                        фізичних зусиль;
                                    </li>
                                    <li>Відкатні ворота, ціна яких хоч і коливається залежно від вибору комплектуючих,
                                        завжди залишаються доступними для всіх категорій покупців, чого не скажеш про
                                        більш дорогі варіанти кованих або дерев’яних масивних воріт;
                                    </li>
                                    <li>Слід також відзначити довговічність воріт, термін їх експлуатації необмежений,
                                        так як матеріали використовуються інноваційні, які не піддаються процесам
                                        розбухання від вологи або утворення іржі.
                                    </li>
                                </ul>
                            </div>
                        </div>
                        <div className="gatesImgStyle" onMouseOver={addHoverStyle}>
                            <img src={Img05} alt="" className="noHoverGatesStyle"/>
                            <img src={Img06} alt="" className="noHoverGatesStyle"/>
                            <img src={Img07} alt="" className="noHoverGatesStyle"/>
                            <img src={Img08} alt="" className="noHoverGatesStyle"/>
                        </div>
                    </div>
                    <div>
                        {/*РОЗПАШНІ ВОРОТА*/}
                        <div>
                            <div className="GatesdescriptionAndInfo">
                                <div className="text_fenseDescription gates_fenseDescription fenceDescr">
                                    <h4>Технічні характеристики</h4>
                                    <p>Завжди вічна класика — розпашні ворота. Розпашні ворота — це розпашні стулки, які
                                        закріплені на опорних стовпах і виконані, як правило, зі сталі високої якості.
                                        Розпашні ворота звичні для нашої людини, і радують її простотою використання й
                                        установки.</p>
                                    <p>Висота розпашних воріт довільна, за бажанням. Проста конструкція розпашних воріт,
                                        невисока ціна, звичність, випробуваність часом, залишають їх лідерами замовлень.
                                        Просто, міцно, довговічно. Самі ворота являють собою дві стулки, що фіксуються
                                        на
                                        паралельних опорах. На вибір замовника ворота можуть відкриватися як назовні,
                                        так і
                                        всередину двору. Наповнення для стулок обирається відповідно до запитів клієнтів
                                        —
                                        зварна сітка, металевий штахет, профнастил, те що пасує об’єкту й огорожі
                                        навколо
                                        нього.</p>
                                    <p>Розпашні ворота мають ряд відмінностей, якщо порівняти їх із розсувними воротами,
                                        хоча технологія виробництва, загалом, єдина. Розпашні ворота можуть бути
                                        виконані в
                                        різних дизайнерських варіантах, і включати в себе різні модулі. У них
                                        поєднуються
                                        сучасні технології та дизайн із класичним строгим стилем. Розпашні ворота можна
                                        використовувати на підприємствах промисловості, на звичайних об’єктах, у рамках
                                        приватного будівництва.</p>
                                    <p>Застосовуючи різноманітні спецаксесуари, комбінуючи їх, можна стати власником
                                        по-справжньому унікальних розпашних воріт. Відповідно до запиту замовника,
                                        розпашні
                                        ворота можна додатково автоматизувати, а також забезпечити їх відкривання в
                                        різні
                                        боки.</p>
                                    <p>Як відзначають фахівці, ворота з розпашними стулками стають ідеальним варіантом
                                        для
                                        тих випадків, коли немає можливості виконати установку розпашних воріт. По суті
                                        справи, розпашні ворота можна розташувати на будь-якій території — від великого
                                        підприємства промисловості до маленької присадибної ділянки.</p>
                                </div>
                                <div className="ol_fenseDescription gates_fenseDescription fenceDescr">
                                    <h3>Переваги розпашних воріт</h3>
                                    <ul>
                                        <li>великий вибір покриттів, розмірів, форм;</li>
                                        <li>ніяких обмежень, пов’язаних із розміром стулок і їх вагою;</li>
                                        <li> легкість в обслуговуванні і простота ремонта;</li>
                                        <li>можуть застосовуватися в будь-яких місцях;</li>
                                        <li>довговічні та міцні;</li>
                                        <li>експлуатація проста й невибаглива.</li>
                                    </ul>
                                </div>
                            </div>
                            <div>
                                <img src={Img09} alt="" className="swingGates"/>
                            </div>
                        </div>

                    </div>
                    <div>
                        {/*МЕТАЛЕВІ ХВІРТКИ*/}
                        <div>
                            <div className="GatesdescriptionAndInfo">
                                <div className="text_fenseDescription gates_fenseDescription fenceDescr">
                                    <h4>Технічні характеристики</h4>
                                    <p>Одними воротами користуватися постійно накладно і важко, тому поруч із воротами
                                        прийнято встановлювати хвіртку. Хвіртка — вхід на Вашу ділянку. Як правило, і
                                        ворота, і хвіртка виготовляються в єдиній стилістиці, з однакових матеріалів,
                                        так як хвіртка — це копія воріт у міні-варіанті. Хвіртка може бути окремим
                                        елементом паркану, а може бути вбудована в самі ворота будь-якого виду.</p>
                                    <p>Стандартна мінімальна ширина хвіртки 90 см. Якщо розміри обраної Вами хвіртки
                                        відрізняються від стандарту — не біда, ми виготовимо металеву хвіртку за
                                        індивідуальними розмірами. В основному і ворота, і хвіртку виготовляють з
                                        однакових матеріалів, як і секції огорожі. Але іноді ці елементи необхідно
                                        підкреслити, виділити, тоді ворота і хвіртка виготовляються відмінного кольору,
                                        наповнення або фактури. Стулка хвіртки розкривається всередину, у двір ділянки,
                                        або назовні, на вулицю. Це пов’язано з тим, які обрані місця кріплення петель
                                        або наявність вільного місця перед огорожею або за ним. Зашивка каркасу
                                        металевої хвіртки вибирається за бажанням замовника, і може бути з профнастила,
                                        євроштахета, сітки, або паркана жалюзі.</p>
                                    <p>Хвіртка з вертикальним штахетником однаково добре гармонує практично з будь-яким
                                        видом паркану й будь-якою архітектурною будівлею. Щоб виділити ворота або
                                        хвіртку, їх часто декорують скульптурами або ліхтарями.</p>
                                    <p>Будь-яка нерівномірність ландшафту не повинна створювати перешкоди для повного
                                        відкриття хвіртки. І стандартно кут при відкритті хвіртки повинен становити
                                        більше 90 градусів. Прилегла територія навколо повинна бути розчищена й
                                        незайнята сторонніми предметами, оскільки восени і взимку майданчик перед
                                        хвірткою необхідно розчищати від листя, снігу, і необхідне місце для
                                        складування, що не заважає відкриттю хвіртки.</p>
                                </div>
                                <div className="ol_fenseDescription gates_fenseDescription wicketDescription fenceDescr">
                                    <h3>Монтаж металевої хвіртки</h3>
                                    <p>Проліт між доріжкою та нижнім краєм воріт або хвірткою дорівнює 5 см. Звичайно,
                                        проліт можна зробити більший 10–15 см, і ворота або хвіртка без труднощів будуть
                                        відкриватися при середньому рівні опадів снігу, але тоді є ризик вторгнення на
                                        територію ділянки сторонніх тварин, які однозначно заподіють шкоди або завдадуть
                                        незручності.</p>
                                    <p>Каркас металевої хвіртки кріпиться між двома металевими або цегляними
                                        стійками-опорами, які повинні бути надійно встановлені в ґрунт у потрібній точці
                                        огорожі на глибину не менше 0,5 м.Краще, якщо висота хвіртки збігається з
                                        висотою Вашої огорожі.</p>
                                    <p>Фурнітуру для хвіртки підбираємо за бажанням замовника або за замовчуванням
                                        робимо стандартну. Також є можливість, за бажанням замовника, вбудувати хвіртку
                                        в полотно воріт.</p>
                                </div>
                            </div>
                            <div className="gatesImgStyle" onMouseOver={addHoverStyle}>
                                <img src={Img10} alt="" className="noHoverGatesStyle"/>
                                <img src={Img11} alt="" className="noHoverGatesStyle"/>
                                <img src={Img12} alt="" className="noHoverGatesStyle"/>
                                <img src={Img13} alt="" className="noHoverGatesStyle"/>
                                <img src={Img15} alt="" className="noHoverGatesStyle"/>
                            </div>
                        </div>
                    </div>
                    <div>
                        {/*АВТОМАТИЧНІ ВОРОТА*/}
                        <div>
                            <div className="GatesdescriptionAndInfo">
                                <div className="text_fenseDescription gates_fenseDescription fenceDescr">
                                    <h4>Технічні характеристики</h4>
                                    <p><b>Автоматичні ворота </b> – це втілення новітніх сучасних технологій, які не
                                        тільки
                                        забезпечують надзвичайно високу безпеку об’єкта, але й створюють комфортні
                                        експлуатаційні умови. Автоматичні ворота оснащуються електричним приводом, який
                                        сприяє легкому управлінню за допомогою дистанційного пульта, а також значному
                                        зменшенню фізичних зусиль.</p>
                                    <p>Найбільш оптимальним варіантом вважається виготовлення автоматичних воріт під
                                        замовлення, оскільки саме в цьому випадку враховуються індивідуальні запити
                                        кожного клієнта пов’язані з естетичними поглядами на дизайн конструкції, а також
                                        особливостями цільового об’єкта й територій поблизу.</p>
                                    <p>З метою підвищення безпеки автоматичні ворота можуть оснащуватися додатковими
                                        вбудованими приладами, а саме датчиками руху, камерами, домофонами,
                                        високотехнологічними контролями доступу, а також дуже корисними системами
                                        оповіщення, які негайно дадуть знати господареві будинку або іншого об’єкта про
                                        несанкціоновані спроби проникнення на його особисту територію.</p>
                                    <p>Крім очевидних переваг, пов’язаних з охоронними функціями, автоматизовані ворота
                                        повністю адаптовані до вітчизняних погодних умов, що забезпечує їх безперервну й
                                        довговічну роботу. У разі непередбаченого відключення електроживлення, система
                                        самостійно розпізнає ситуацію, що склалася й переключається на автономний режим,
                                        без припинення виконання своїх функцій.</p>
                                    <p>На сьогодні, вибір автоматичних воріт надзвичайно великий, тому найголовніше
                                        довірити їх виконання справжнім майстрам своєї справи, які не тільки врахують
                                        усі побажання замовника й підберуть найбільш оптимальний варіант, але й нададуть
                                        гарантійне обслуговування протягом досить тривалого періоду експлуатації.</p>
                                </div>
                                <div className="ol_fenseDescription gates_fenseDescription wicketDescription fenceDescr">
                                    <h3>Конструкція автоматичних воріт</h3>
                                    <p>Автоматичні ворота найчастіше мають наступну типову конструкцію:</p>
                                    <ol>
                                        <li><b>Секційну.</b> Ворота даного типу найбільш часто застосовуються в умовах
                                            обмеженого простору, так як відкриття проводиться по вертикалі й досягає
                                            свого фіксованого положення під стелею;
                                        </li>
                                        <li><b>Відкатну.</b> Як правило, відкатні ворота застосовуються на об’єктах зі
                                            значною шириною пройому, так як саме вони дозволяють найбільш раціонально
                                            використовувати вільне місце, не впливаючи на рівень міцності та надійності;
                                        </li>
                                        <li><b>Розпашну.</b> Цей тип конструкції складається з двох стулок, які
                                            відкриваються в зовнішньому напрямку. Особливістю розпашних воріт вважається
                                            багатогранність дизайну, який може варіюватися від витончених кованих
                                            елементів до простих і функціональних сендвіч-панелей.
                                        </li>
                                    </ol>
                                </div>
                            </div>
                            <div className="gatesImgStyle" onMouseOver={addHoverStyle}>
                                <img src={Img16} alt="" className="noHoverGatesStyle"/>
                                <img src={Img17} alt="" className="noHoverGatesStyle"/>
                                <img src={Img19} alt="" className="noHoverGatesStyle"/>
                                <img src={Img20} alt="" className="noHoverGatesStyle"/>
                            </div>
                        </div>
                    </div>
                </Slider>

            </div>
        );
    }
}